#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-API-Dev/runs/run-WPuL9xHVNRtjDwnQ

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.lambda.data.archive_file.meal_recipes_retrieve_zip: Refreshing...
module.lambda.data.archive_file.masterdata_shared_layer_zip: Refreshing...
module.lambda.data.archive_file.meal_recipes_insert_zip: Refreshing...
module.lambda.data.archive_file.meal_recipes_retrieve_zip: Refresh complete after 0s [id=6c8ff79936f1c07c65f74a02f09f032d03fd6432]
module.lambda.data.archive_file.weight_measurements_edit_zip: Refreshing...
module.lambda.data.archive_file.common_layer_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refreshing...
module.lambda.data.archive_file.meal_shared_layer_zip: Refreshing...
module.lambda.data.archive_file.meal_recipes_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.meal_recipes_insert_zip: Refresh complete after 0s [id=243c36b5662011ee94eba626643b8b0908fd5675]
module.lambda.data.archive_file.meal_recipes_delete_zip: Refreshing...
module.lambda.data.archive_file.masterdata_shared_layer_zip: Refresh complete after 0s [id=ee4010222772d9b5eec12ca5b337fbfa6428bc24]
module.lambda.data.archive_file.weight_measurements_edit_zip: Refresh complete after 0s [id=f83d1b089d4e11042c7e3c710fab7a26764612a4]
module.lambda.data.archive_file.meal_recipes_delete_user_data_zip: Refresh complete after 0s [id=8744e9c7d1f1b6ab1a7167fef0f6648337dcab31]
module.lambda.data.archive_file.weight_targets_retrieve_zip: Refresh complete after 0s [id=c8405ce6ee968228ec5707d61c452e28c4d65441]
module.lambda.data.archive_file.meal_shared_layer_zip: Refresh complete after 0s [id=0f6cc02055c8d96f5a5d94e3bb2195f5e214515c]
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.common_layer_zip: Refresh complete after 0s [id=8e80e7124e607d6cc693f298280360dd76c08018]
module.lambda.data.archive_file.meal_recipes_delete_zip: Refresh complete after 0s [id=78070cb59a67272de1cbc8357cf476795f8e8cc6]
module.lambda.data.archive_file.weight_measurements_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_insert_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_delete_user_data_zip: Refresh complete after 0s [id=10bf61571e847c37ccc251100c5f0b2a2413290f]
module.lambda.data.archive_file.weight_measurements_delete_zip: Refresh complete after 0s [id=d03bb95d7a1f5970bdd83a7c3f16887e977f4ac7]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refreshing...
module.lambda.data.archive_file.meal_recipes_edit_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_delete_zip: Refreshing...
module.lambda.data.archive_file.weight_measurements_insert_zip: Refreshing...
module.lambda.data.archive_file.meal_recipes_edit_zip: Refresh complete after 0s [id=8b371688429b4ba39609c01cbad6ee2bb66c3b06]
module.lambda.data.archive_file.weight_targets_insert_zip: Refresh complete after 0s [id=3d2fdf3f770c1d41232916db708a5b304ea7e586]
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_shared_layer_zip: Refreshing...
module.lambda.data.archive_file.list_values_retrieve_zip: Refreshing...
module.lambda.data.archive_file.weight_targets_delete_zip: Refresh complete after 0s [id=f56bf6eca1a8c4a454d9d87ae542eaab60bff1a2]
module.lambda.data.archive_file.weight_targets_delete_user_data_zip: Refresh complete after 0s [id=69a8a4b37fc7a5b19fa9913344b05a006a49fb0b]
module.lambda.data.archive_file.weight_measurements_retrieve_zip: Refresh complete after 0s [id=ec20289294bdac87be5b498fc7ef9b5ef2a5d7f1]
module.lambda.data.archive_file.list_values_retrieve_zip: Refresh complete after 0s [id=81e29f9d5fae6a70ada26529356c243f0bffd251]
module.lambda.data.archive_file.weight_shared_layer_zip: Refresh complete after 0s [id=0c4ae4f1599f858ecdfc6b06acf9cb6c8accd8bc]
module.lambda.data.archive_file.weight_measurements_insert_zip: Refresh complete after 0s [id=6dc2139f20880a1e484c02f24836ef08d80be713]
module.lambda.aws_cloudwatch_log_group.meal_recipes_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-meal-recipes-delete-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-insert-dev]
module.lambda.aws_cloudwatch_log_group.weight_targets_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-retrieve-dev]
module.sns_and_sqs.aws_sns_topic.delete_user_data: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev]
module.db.aws_dynamodb_table.jowe_measurements: Refreshing state... [id=JoWe-weight-measurements-dev]
module.lambda.data.aws_iam_policy_document.assume_role: Refreshing...
module.lambda.aws_cloudwatch_log_group.meal_recipes_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-meal-recipes-delete-user-data-dev]
module.api.aws_api_gateway_rest_api.jowe_api: Refreshing state... [id=gaj1kflz21]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dead-letter-dev]
module.db.aws_dynamodb_table.jowe_weight_targets: Refreshing state... [id=JoWe-weight-targets-dev]
module.lambda.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2690255455]
module.api.aws_api_gateway_domain_name.custom_domain_name: Refreshing state... [id=jowe-api-dev.initialised.si]
module.lambda.aws_cloudwatch_log_group.weight_measurements_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-insert-dev]
module.lambda.aws_lambda_layer_version.weight_shared_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-user-data-dev]
module.lambda.aws_lambda_layer_version.meal_shared_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10]
module.auth.aws_cognito_user_pool.user_pool: Refreshing state... [id=eu-south-1_lu9o6yXs7]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refreshing...
module.lambda.aws_cloudwatch_log_group.meal_recipes_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-meal-recipes-retrieve-dev]
module.lambda.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Refresh complete after 0s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.lambda.aws_cloudwatch_event_rule.user_data_deletion_schedule: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev]
module.db.aws_dynamodb_table.jowe_list_values: Refreshing state... [id=JoWe-list-values-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-retrieve-dev]
module.lambda.aws_cloudwatch_log_group.meal_recipes_edit_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-meal-recipes-edit-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_delete_user_data_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-delete-user-data-dev]
module.lambda.aws_cloudwatch_log_group.list_values_retrieve_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-list-values-retrieve-dev]
module.lambda.aws_lambda_layer_version.common_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34]
module.sns_and_sqs.aws_sqs_queue.meal_recipes_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-meal-recipes-delete-user-data-dead-letter-dev]
module.db.aws_dynamodb_table.jowe_meal_recipes: Refreshing state... [id=JoWe-meal-recipes-dev]
module.lambda.aws_lambda_layer_version.masterdata_shared_layer: Refreshing state... [id=arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-masterdata-shared-layer:5]
module.lambda.aws_cloudwatch_log_group.weight_targets_delete_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-targets-delete-dev]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_dead_letter_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dead-letter-dev]
module.api.data.aws_iam_policy_document.assume_role: Refreshing...
module.api.data.aws_iam_policy_document.assume_role: Refresh complete after 0s [id=2699642182]
module.lambda.aws_cloudwatch_log_group.meal_recipes_insert_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-meal-recipes-insert-dev]
module.lambda.aws_cloudwatch_log_group.weight_measurements_edit_lambda_log_group: Refreshing state... [id=/aws/lambda/JoWe-api-weight-measurements-edit-dev]
module.lambda.aws_iam_role.jowe_api_lambda_crud: Refreshing state... [id=JoWe-api-lambda-crud-dev]
module.lambda.aws_iam_role.jowe_api_lambda_read_only: Refreshing state... [id=JoWe-api-lambda-read-only-dev]
module.api.aws_api_gateway_model.weight_targets_insert_request: Refreshing state... [id=3z47ce]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_4XX: Refreshing state... [id=aggr-gaj1kflz21-DEFAULT_4XX]
module.api.aws_api_gateway_request_validator.jowe_api_request_validator: Refreshing state... [id=s8r6jk]
module.api.aws_api_gateway_model.weight_measurements_response: Refreshing state... [id=xxtjfs]
module.api.aws_api_gateway_gateway_response.jowe_api_gateway_response_default_5XX: Refreshing state... [id=aggr-gaj1kflz21-DEFAULT_5XX]
module.api.aws_api_gateway_model.meal_recipe_response: Refreshing state... [id=c4etr8]
module.api.aws_api_gateway_model.meal_recipes_insert_request: Refreshing state... [id=vqvf86]
module.api.aws_api_gateway_resource.meal_resource: Refreshing state... [id=q0siro]
module.api.aws_api_gateway_resource.weight_resource: Refreshing state... [id=9d506r]
module.api.aws_api_gateway_model.masterdata_list_values_response: Refreshing state... [id=lhyjwn]
module.api.aws_api_gateway_model.weight_measurement_response: Refreshing state... [id=0f8g78]
module.api.aws_api_gateway_resource.masterdata_resource: Refreshing state... [id=b2sdn4]
module.api.aws_api_gateway_model.weight_targets_response: Refreshing state... [id=7rivhe]
module.api.aws_api_gateway_model.weight_target_response: Refreshing state... [id=o240xi]
module.api.aws_api_gateway_model.common_error_response: Refreshing state... [id=oybbak]
module.api.aws_api_gateway_model.meal_recipes_response: Refreshing state... [id=ppd3ng]
module.api.aws_api_gateway_model.weight_measurements_insert_request: Refreshing state... [id=sf781u]
module.api.aws_api_gateway_resource.admin_resource: Refreshing state... [id=ma74g7]
module.sns_and_sqs.aws_sqs_queue.weight_targets_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sns_delete_user_data_topic_publish_policy: Refresh complete after 0s [id=274515956]
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_measurements_crud_policy: Refresh complete after 0s [id=2947198833]
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_read_only_policy_doc: Refresh complete after 0s [id=3300638104]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_crud_policy: Refresh complete after 0s [id=1080394040]
module.db.data.aws_iam_policy_document.dynamodb_jowe_weight_target_read_only_policy: Refresh complete after 0s [id=3281627535]
module.api.aws_iam_role.jowe_api_gateway_role: Refreshing state... [id=JoWe-api-gateway-role-dev]
module.db.data.aws_iam_policy_document.dynamodb_jowe_list_values_read_only_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_list_values_read_only_policy: Refresh complete after 0s [id=857723168]
module.db.data.aws_iam_policy_document.dynamodb_jowe_list_values_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_list_values_crud_policy: Refresh complete after 0s [id=3899673244]
module.auth.aws_cognito_user_pool_client.client: Refreshing state... [id=73789kqs6iec23pqcqjsq0ted8]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_crud_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192625378200000002]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_read_only_AWSLambdaBasicExecutionRole_attachment: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192625368600000001]
module.sns_and_sqs.aws_sqs_queue.meal_recipes_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-meal-recipes-delete-user-data-dev]
module.sns_and_sqs.aws_sqs_queue.weight_measurements_delete_user_data_queue: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dev]
module.db.data.aws_iam_policy_document.dynamodb_jowe_meal_recipes_crud_policy: Refreshing...
module.db.data.aws_iam_policy_document.dynamodb_jowe_meal_recipes_crud_policy: Refresh complete after 0s [id=589940051]
module.db.data.aws_iam_policy_document.dynamodb_jowe_meal_recipes_read_only_policy: Refreshing...
module.api.aws_api_gateway_resource.meal_recipes_resource: Refreshing state... [id=a6u6vg]
module.db.data.aws_iam_policy_document.dynamodb_jowe_meal_recipes_read_only_policy: Refresh complete after 0s [id=3777320303]
module.api.aws_api_gateway_resource.weight_targets_resource: Refreshing state... [id=l1qa8q]
module.api.aws_api_gateway_resource.weight_measurements_resource: Refreshing state... [id=t9qag3]
module.sns_and_sqs.aws_iam_policy.sns_delete_user_data_topic_publish_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sns-delete-user-data-topic-publish-policy-dev]
module.db.aws_iam_policy.dynamodb_measurements_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-crud-policy-dev]
module.db.aws_iam_policy.dynamodb_measurements_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-measurements-read-only-policy-dev]
module.db.aws_iam_policy.dynamodb_weight_target_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-crud-policy-dev]
module.db.aws_iam_policy.dynamodb_weight_target_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-weight-target-read-only-policy-dev]
module.api.aws_api_gateway_resource.masterdata_list_values_resource: Refreshing state... [id=bsqofp]
module.db.aws_iam_policy.dynamodb_list_values_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-list_values-read-only-policy-dev]
module.db.aws_iam_policy.dynamodb_list_values_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-list_values-crud-policy-dev]
module.db.aws_iam_policy.dynamodb_meal_recipes_crud_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-meal_recipes-crud-policy-dev]
module.db.aws_iam_policy.dynamodb_meal_recipes_read_only_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-dynamodb-meal_recipes-read-only-policy-dev]
module.api.aws_api_gateway_resource.delete_user_data: Refreshing state... [id=j8n2v2]
module.api.aws_api_gateway_account.jowe_api_gateway_account: Refreshing state... [id=api-gateway-account]
module.api.aws_iam_role_policy.api_gateway_cloudwatch_policy: Refreshing state... [id=JoWe-api-gateway-role-dev:JoWe-api-gateway-cloudwatch-policy-dev]
module.api.aws_api_gateway_method.meal_recipes_method_options: Refreshing state... [id=agm-gaj1kflz21-a6u6vg-OPTIONS]
module.api.aws_api_gateway_resource.meal_recipes_id_resource: Refreshing state... [id=6oclb6]
module.api.aws_api_gateway_resource.weight_measurements_id_resource: Refreshing state... [id=kntxqx]
module.api.aws_api_gateway_authorizer.jowe_api_authorizer: Refreshing state... [id=p6bbhi]
module.api.aws_api_gateway_method.weight_measurements_method_options: Refreshing state... [id=agm-gaj1kflz21-t9qag3-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_method_options: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-OPTIONS]
module.api.aws_api_gateway_resource.weight_targets_id_resource: Refreshing state... [id=pu0tuf]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_targets_delete_user_data_queue_process_policy: Refresh complete after 0s [id=1171862333]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_targets_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-targets-delete-user-data-dev]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_targets: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev:356c500b-0819-4a27-9b3b-c5dff079456c]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_meal_recipes_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-meal-recipes-delete-user-data-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_meal_recipes_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_meal_recipes_delete_user_data_queue_process_policy: Refresh complete after 0s [id=1010123113]
module.api.aws_api_gateway_resource.masterdata_list_values_id_resource: Refreshing state... [id=59jb9r]
module.api.aws_api_gateway_method.masterdata_list_values_method_options: Refreshing state... [id=agm-gaj1kflz21-bsqofp-OPTIONS]
module.api.aws_api_gateway_method.delete_user_data_method_options: Refreshing state... [id=agm-gaj1kflz21-j8n2v2-OPTIONS]
module.sns_and_sqs.aws_iam_policy.sqs_weight_targets_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-targets-delete-user-data-queue-policy-dev]
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing...
module.sns_and_sqs.data.aws_iam_policy_document.sqs_weight_measurements_delete_user_data_queue_process_policy: Refresh complete after 0s [id=4141459059]
module.sns_and_sqs.aws_sqs_queue_policy.delete_user_data_weight_measurements_subscription: Refreshing state... [id=https://sqs.eu-south-1.amazonaws.com/834514932971/JoWe-weight-measurements-delete-user-data-dev]
module.sns_and_sqs.aws_sns_topic_subscription.delete_user_data_weight_measurements: Refreshing state... [id=arn:aws:sns:eu-south-1:834514932971:JoWe-delete-user-data-topic-dev:7a6375cd-e4ce-48b7-85ac-8cc58ef3f811]
module.api.aws_api_gateway_integration.meal_recipes_integration_options: Refreshing state... [id=agi-gaj1kflz21-a6u6vg-OPTIONS]
module.sns_and_sqs.aws_iam_policy.sqs_meal_recipes_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-meal-recipes-delete-user-data-queue-policy-dev]
module.api.aws_api_gateway_method.meal_recipes_id_method_options: Refreshing state... [id=agm-gaj1kflz21-6oclb6-OPTIONS]
module.api.aws_api_gateway_method.weight_measurements_id_method_options: Refreshing state... [id=agm-gaj1kflz21-kntxqx-OPTIONS]
module.api.aws_api_gateway_integration.weight_measurements_integration_options: Refreshing state... [id=agi-gaj1kflz21-t9qag3-OPTIONS]
module.api.aws_api_gateway_method.weight_measurements_id_method_put: Refreshing state... [id=agm-gaj1kflz21-kntxqx-PUT]
module.api.aws_api_gateway_method.weight_targets_method_post: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-POST]
module.api.aws_api_gateway_method.meal_recipes_id_method_get: Refreshing state... [id=agm-gaj1kflz21-6oclb6-GET]
module.api.aws_api_gateway_method.meal_recipes_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-6oclb6-DELETE]
module.api.aws_api_gateway_method.weight_measurements_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-kntxqx-DELETE]
module.api.aws_api_gateway_method.meal_recipes_id_method_put: Refreshing state... [id=agm-gaj1kflz21-6oclb6-PUT]
module.api.aws_api_gateway_method.meal_recipes_method_get: Refreshing state... [id=agm-gaj1kflz21-a6u6vg-GET]
module.api.aws_api_gateway_method.weight_measurements_method_post: Refreshing state... [id=agm-gaj1kflz21-t9qag3-POST]
module.api.aws_api_gateway_method.weight_measurements_id_method_get: Refreshing state... [id=agm-gaj1kflz21-kntxqx-GET]
module.api.aws_api_gateway_method.weight_measurements_method_get: Refreshing state... [id=agm-gaj1kflz21-t9qag3-GET]
module.api.aws_api_gateway_method.meal_recipes_method_post: Refreshing state... [id=agm-gaj1kflz21-a6u6vg-POST]
module.api.aws_api_gateway_method.weight_targets_method_get: Refreshing state... [id=agm-gaj1kflz21-l1qa8q-GET]
module.api.aws_api_gateway_method.delete_user_data_method_post: Refreshing state... [id=agm-gaj1kflz21-j8n2v2-POST]
module.sns_and_sqs.aws_iam_policy.sqs_weight_measurements_delete_user_data_queue_process_policy: Refreshing state... [id=arn:aws:iam::834514932971:policy/JoWe-sqs-weight-measurements-delete-user-data-queue-policy-dev]
module.api.aws_api_gateway_integration.weight_targets_integration_options: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_id_method_get: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-GET]
module.api.aws_api_gateway_method.weight_targets_id_method_options: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-OPTIONS]
module.api.aws_api_gateway_method.weight_targets_id_method_delete: Refreshing state... [id=agm-gaj1kflz21-pu0tuf-DELETE]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192637358700000003]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_measurements: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192637370000000005]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192637369400000004]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_meal_recipes: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230827170641319900000002]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_meal_recipes: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230827170641317500000001]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_weight_targets: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230725192637373300000006]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_crud_role_attachment_list_values: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230830191923980700000001]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_dynamodb_read_only_role_attachment_list_values: Refreshing state... [id=JoWe-api-lambda-read-only-dev-20230830191923980800000002]
module.api.aws_api_gateway_method.masterdata_list_values_id_method_options: Refreshing state... [id=agm-gaj1kflz21-59jb9r-OPTIONS]
module.api.aws_api_gateway_method.masterdata_list_values_id_method_get: Refreshing state... [id=agm-gaj1kflz21-59jb9r-GET]
module.api.aws_api_gateway_integration.masterdata_list_values_integration_options: Refreshing state... [id=agi-gaj1kflz21-bsqofp-OPTIONS]
module.api.aws_api_gateway_integration.delete_user_data_integration_options: Refreshing state... [id=agi-gaj1kflz21-j8n2v2-OPTIONS]
module.api.aws_api_gateway_method_response.meal_recipes_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-OPTIONS-200]
module.api.aws_api_gateway_integration.meal_recipes_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-6oclb6-OPTIONS]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-kntxqx-OPTIONS]
module.api.aws_api_gateway_method_response.weight_measurements_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-OPTIONS-200]
module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-measurements-retrieve-dev]
module.lambda.aws_lambda_function.weight_measurements_insert_lambda: Refreshing state... [id=JoWe-api-weight-measurements-insert-dev]
module.lambda.aws_lambda_function.weight_measurements_delete_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-dev]
module.lambda.aws_lambda_function.weight_measurements_edit_lambda: Refreshing state... [id=JoWe-api-weight-measurements-edit-dev]
module.api.aws_api_gateway_method_response.weight_targets_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-OPTIONS-200]
module.lambda.aws_lambda_function.weight_targets_insert_lambda: Refreshing state... [id=JoWe-api-weight-targets-insert-dev]
module.lambda.aws_lambda_function.weight_targets_delete_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-dev]
module.lambda.aws_lambda_function.meal_recipes_retrieve_lambda: Refreshing state... [id=JoWe-api-meal-recipes-retrieve-dev]
module.lambda.aws_lambda_function.meal_recipes_insert_lambda: Refreshing state... [id=JoWe-api-meal-recipes-insert-dev]
module.lambda.aws_lambda_function.meal_recipes_delete_lambda: Refreshing state... [id=JoWe-api-meal-recipes-delete-dev]
module.lambda.aws_lambda_function.meal_recipes_edit_lambda: Refreshing state... [id=JoWe-api-meal-recipes-edit-dev]
module.api.aws_api_gateway_integration.weight_targets_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-OPTIONS]
module.lambda.aws_lambda_function.weight_targets_retrieve_lambda: Refreshing state... [id=JoWe-api-weight-targets-retrieve-dev]
module.lambda.aws_lambda_function.list_values_retrieve_lambda: Refreshing state... [id=JoWe-api-list-values-retrieve-dev]
module.api.aws_api_gateway_method_response.masterdata_list_values_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-bsqofp-OPTIONS-200]
module.api.aws_api_gateway_integration.masterdata_list_values_id_integration_options: Refreshing state... [id=agi-gaj1kflz21-59jb9r-OPTIONS]
module.api.aws_api_gateway_method_response.delete_user_data_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-OPTIONS-200]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-OPTIONS-200]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-OPTIONS-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-t9qag3-OPTIONS-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-OPTIONS-200]
module.api.aws_iam_role_policy_attachment.jowe_api_gateway_sns_delete_user_data_topic_publish_role_attachment: Refreshing state... [id=JoWe-api-gateway-role-dev-20230820173629212400000001]
module.api.aws_api_gateway_integration.delete_user_data_integration_post: Refreshing state... [id=agi-gaj1kflz21-j8n2v2-POST]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_targets_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192715349600000007]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_meal_recipes_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230827170727965500000003]
module.lambda.aws_iam_role_policy_attachment.jowe_api_lambda_sqs_processing_weight_measurements_delete_user_data_role_attachment: Refreshing state... [id=JoWe-api-lambda-crud-dev-20230725192715354100000009]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-kntxqx-OPTIONS-200]
module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-targets-delete-user-data-dev]
module.lambda.aws_lambda_function.meal_recipes_delete_user_data_lambda: Refreshing state... [id=JoWe-api-meal-recipes-delete-user-data-dev]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-6oclb6-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-OPTIONS-200]
module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda: Refreshing state... [id=JoWe-api-weight-measurements-delete-user-data-dev]
module.api.aws_api_gateway_method_response.masterdata_list_values_id_method_options_200: Refreshing state... [id=agmr-gaj1kflz21-59jb9r-OPTIONS-200]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-POST-500]
module.api.aws_api_gateway_method_response.delete_user_data_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-j8n2v2-POST-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_options_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-OPTIONS-200]
module.api.aws_api_gateway_integration_response.masterdata_list_values_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-bsqofp-OPTIONS-200]
module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-59jb9r-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-POST-500]
module.lambda.aws_lambda_permission.weight_targets_delete_user_data_lambda_cloudwatch_permission: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.lambda.aws_cloudwatch_event_target.user_data_deletion_schedule_weight_targets: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev-terraform-20230825223919251000000001]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_options_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-OPTIONS-200]
module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-j8n2v2-POST-200]
module.lambda.aws_lambda_permission.meal_recipes_delete_user_data_lambda_cloudwatch_permission: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.lambda.aws_cloudwatch_event_target.user_data_deletion_schedule_meal_recipes: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev-terraform-20230827170825646200000004]
module.lambda.aws_lambda_permission.weight_measurements_delete_user_data_lambda_cloudwatch_permission: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.lambda.aws_cloudwatch_event_target.user_data_deletion_schedule_weight_measurements: Refreshing state... [id=JoWe-cloudwatch-user-data-deletion-schedule-dev-terraform-20230825205125577600000001]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_meal_recipes: Refreshing state... [id=terraform-20230827170842156700000007]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_target: Refreshing state... [id=terraform-20230725192742655400000011]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_meal_recipe: Refreshing state... [id=terraform-2023082717084242510000000a]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_measurement: Refreshing state... [id=terraform-20230725192742658500000012]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_measurements: Refreshing state... [id=terraform-2023072519274241260000000f]
module.api.aws_lambda_permission.gateway_lambda_permission_put_meal_recipe: Refreshing state... [id=terraform-20230827170841912400000005]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_measurement: Refreshing state... [id=terraform-2023072519274241150000000b]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_single_weight_measurements: Refreshing state... [id=terraform-2023072519274241200000000d]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_weight_targets: Refreshing state... [id=terraform-2023072519274241160000000c]
module.api.aws_lambda_permission.gateway_lambda_permission_get_id_weight_target: Refreshing state... [id=terraform-2023072519274240960000000a]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_meal_recipes: Refreshing state... [id=terraform-20230827192542198800000001]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_measurements: Refreshing state... [id=terraform-2023072519274241240000000e]
module.api.aws_lambda_permission.gateway_lambda_permission_post_weight_targets: Refreshing state... [id=terraform-20230725192742660500000013]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_weight_target: Refreshing state... [id=terraform-20230725192742652900000010]
module.api.aws_lambda_permission.gateway_lambda_permission_retrieve_all_masterdata_list_values: Refreshing state... [id=terraform-20230830203837651200000001]
module.api.aws_lambda_permission.gateway_lambda_permission_post_meal_recipes: Refreshing state... [id=terraform-20230827170842408800000008]
module.api.aws_lambda_permission.gateway_lambda_permission_delete_meal_recipe: Refreshing state... [id=terraform-20230827170841913100000006]
module.api.aws_lambda_permission.gateway_lambda_permission_put_weight_measurement: Refreshing state... [id=terraform-20230809191851589900000001]
module.api.aws_api_gateway_integration.meal_recipes_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-6oclb6-GET]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-kntxqx-GET]
module.api.aws_api_gateway_integration.weight_measurements_integration_get: Refreshing state... [id=agi-gaj1kflz21-t9qag3-GET]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-kntxqx-DELETE]
module.api.aws_api_gateway_integration.meal_recipes_id_integration_put: Refreshing state... [id=agi-gaj1kflz21-6oclb6-PUT]
module.api.aws_api_gateway_integration.weight_targets_integration_get: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-GET]
module.api.aws_api_gateway_integration.weight_measurements_integration_post: Refreshing state... [id=agi-gaj1kflz21-t9qag3-POST]
module.api.aws_api_gateway_integration.weight_targets_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-GET]
module.api.aws_api_gateway_integration.meal_recipes_integration_get: Refreshing state... [id=agi-gaj1kflz21-a6u6vg-GET]
module.api.aws_api_gateway_integration.weight_targets_integration_post: Refreshing state... [id=agi-gaj1kflz21-l1qa8q-POST]
module.api.aws_api_gateway_integration.weight_targets_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-pu0tuf-DELETE]
module.api.aws_api_gateway_integration.masterdata_list_values_id_integration_get: Refreshing state... [id=agi-gaj1kflz21-59jb9r-GET]
module.api.aws_api_gateway_integration.meal_recipes_integration_post: Refreshing state... [id=agi-gaj1kflz21-a6u6vg-POST]
module.api.aws_api_gateway_integration.weight_measurements_id_integration_put: Refreshing state... [id=agi-gaj1kflz21-kntxqx-PUT]
module.api.aws_api_gateway_integration.meal_recipes_id_integration_delete: Refreshing state... [id=agi-gaj1kflz21-6oclb6-DELETE]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-GET-400]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-GET-400]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-GET-500]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-400]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-GET-500]
module.api.aws_api_gateway_method_response.meal_recipes_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-GET-400]
module.api.aws_api_gateway_method_response.meal_recipes_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-GET-200]
module.api.aws_api_gateway_method_response.meal_recipes_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-GET-500]
module.api.aws_api_gateway_method_response.weight_targets_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-500]
module.api.aws_api_gateway_method_response.weight_targets_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-400]
module.api.aws_api_gateway_method_response.weight_targets_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-l1qa8q-POST-200]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-DELETE-500]
module.api.aws_api_gateway_method_response.weight_targets_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-pu0tuf-DELETE-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_200: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-GET-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_500: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-GET-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_res_get_400: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-GET-400]
module.api.aws_api_gateway_method_response.masterdata_list_values_id_method_get_200: Refreshing state... [id=agmr-gaj1kflz21-59jb9r-GET-200]
module.api.aws_api_gateway_method_response.masterdata_list_values_id_method_get_400: Refreshing state... [id=agmr-gaj1kflz21-59jb9r-GET-400]
module.api.aws_api_gateway_method_response.masterdata_list_values_id_method_get_500: Refreshing state... [id=agmr-gaj1kflz21-59jb9r-GET-500]
module.api.aws_api_gateway_method_response.meal_recipes_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-POST-500]
module.api.aws_api_gateway_method_response.meal_recipes_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-POST-200]
module.api.aws_api_gateway_method_response.meal_recipes_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-a6u6vg-POST-400]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-DELETE-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-DELETE-200]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_put_500: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-PUT-500]
module.api.aws_api_gateway_method_response.weight_measurements_id_method_put_200: Refreshing state... [id=agmr-gaj1kflz21-kntxqx-PUT-200]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_delete_200: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-DELETE-200]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_delete_500: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-t9qag3-GET-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-t9qag3-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-t9qag3-GET-400]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-6oclb6-GET-400]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-6oclb6-GET-500]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-6oclb6-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-200]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-GET-400]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-500]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-GET-500]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-400]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200: Refreshing state... [id=agir-gaj1kflz21-kntxqx-GET-200]
module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-l1qa8q-POST-200]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-kntxqx-GET-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400: Refreshing state... [id=agir-gaj1kflz21-kntxqx-GET-400]
module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-59jb9r-GET-200]
module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_get_res_400: Refreshing state... [id=agir-gaj1kflz21-59jb9r-GET-400]
module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_res_get_500: Refreshing state... [id=agir-gaj1kflz21-59jb9r-GET-500]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-POST-500]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-POST-200]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-POST-400]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-kntxqx-DELETE-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-kntxqx-DELETE-200]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_500: Refreshing state... [id=agir-gaj1kflz21-kntxqx-PUT-500]
module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_200: Refreshing state... [id=agir-gaj1kflz21-kntxqx-PUT-200]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_delete_200: Refreshing state... [id=agir-gaj1kflz21-6oclb6-DELETE-200]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-6oclb6-DELETE-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_400: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-POST-400]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_500: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-POST-500]
module.api.aws_api_gateway_method_response.weight_measurements_method_post_200: Refreshing state... [id=agmr-gaj1kflz21-t9qag3-POST-200]
module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500: Refreshing state... [id=agir-gaj1kflz21-pu0tuf-DELETE-500]
module.api.aws_api_gateway_integration_response.meal_recipes_integration_get_res_200: Refreshing state... [id=agir-gaj1kflz21-a6u6vg-GET-200]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400: Refreshing state... [id=agir-gaj1kflz21-t9qag3-POST-400]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500: Refreshing state... [id=agir-gaj1kflz21-t9qag3-POST-500]
module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200: Refreshing state... [id=agir-gaj1kflz21-t9qag3-POST-200]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_put_200: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-PUT-200]
module.api.aws_api_gateway_method_response.meal_recipes_id_method_put_500: Refreshing state... [id=agmr-gaj1kflz21-6oclb6-PUT-500]
module.api.aws_api_gateway_deployment.jowe_api_deployment: Refreshing state... [id=5bq0h3]
module.api.aws_api_gateway_stage.jowe_stage: Refreshing state... [id=ags-gaj1kflz21-dev]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_put_200: Refreshing state... [id=agir-gaj1kflz21-6oclb6-PUT-200]
module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_put_500: Refreshing state... [id=agir-gaj1kflz21-6oclb6-PUT-500]
module.api.aws_api_gateway_base_path_mapping.custom_domain_name_stage_mapping: Refreshing state... [id=jowe-api-dev.initialised.si/]
module.api.aws_api_gateway_method_settings.jowe_stage_settings: Refreshing state... [id=gaj1kflz21-dev-*/*]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.api.aws_api_gateway_deployment.jowe_api_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "jowe_api_deployment" {
      ~ created_date  = "2023-09-07T22:54:11Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:eu-south-1:834514932971:gaj1kflz21/" -> (known after apply)
      ~ id            = "5bq0h3" -> (known after apply)
      ~ invoke_url    = "https://gaj1kflz21.execute-api.eu-south-1.amazonaws.com/" -> (known after apply)
      ~ variables     = { # forces replacement
          - "deployed_at" = "2023-09-07T22:54:11Z"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.delete_user_data_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "delete_user_data_integration_options" {
        id                   = "agi-gaj1kflz21-j8n2v2-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.masterdata_list_values_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "masterdata_list_values_id_integration_get" {
        id                      = "agi-gaj1kflz21-59jb9r-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    listId = "$input.params('listId')"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.masterdata_list_values_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "masterdata_list_values_id_integration_options" {
        id                   = "agi-gaj1kflz21-59jb9r-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.masterdata_list_values_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "masterdata_list_values_integration_options" {
        id                   = "agi-gaj1kflz21-bsqofp-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_id_integration_delete" {
        id                      = "agi-gaj1kflz21-6oclb6-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recipeId = "$input.params('recipeId')"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_id_integration_get" {
        id                      = "agi-gaj1kflz21-6oclb6-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recipeId = "$input.params('recipeId')"
                    type     = "single"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_id_integration_options" {
        id                   = "agi-gaj1kflz21-6oclb6-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_id_integration_put will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_id_integration_put" {
        id                      = "agi-gaj1kflz21-6oclb6-PUT"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - {
              -   "recipe" : {
              -     "recipeId": "$input.params('recipeId')",
              -     "userId": "$context.authorizer.claims.sub",
              -     "name": "$inputRoot.recipe.name",
              -     "ingredients": $inputRoot.recipe.ingredients,
              -     "preparation": "$inputRoot.recipe.preparation",
              -     "preparationTime": $inputRoot.recipe.preparationTime,
              -     "favorite": $inputRoot.recipe.favorite
              -   }
              + #set($inputRoot = $input.path('$'))
              + {
              +   "recipe" : {
              +     "recipeId": "$input.params('recipeId')",
              +     "userId": "$context.authorizer.claims.sub",
              +     "name": "$inputRoot.recipe.name",
              +     "ingredients": $inputRoot.recipe.ingredients,
              +     "preparation": "$inputRoot.recipe.preparation",
              +     "preparationTime": $inputRoot.recipe.preparationTime,
              +     "favorite": $inputRoot.recipe.favorite
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_integration_get" {
        id                      = "agi-gaj1kflz21-a6u6vg-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_integration_options" {
        id                   = "agi-gaj1kflz21-a6u6vg-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.meal_recipes_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "meal_recipes_integration_post" {
        id                      = "agi-gaj1kflz21-a6u6vg-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - {
              -   "recipe" : {
              -     "userId": "$context.authorizer.claims.sub",
              -     "name": "$inputRoot.recipe.name",
              -     "ingredients": $inputRoot.recipe.ingredients,
              -     "preparation": "$inputRoot.recipe.preparation",
              -     "preparationTime": $inputRoot.recipe.preparationTime,
              -     "favorite": $inputRoot.recipe.favorite
              -   }
              + #set($inputRoot = $input.path('$'))
              + {
              +   "recipe" : {
              +     "userId": "$context.authorizer.claims.sub",
              +     "name": "$inputRoot.recipe.name",
              +     "ingredients": $inputRoot.recipe.ingredients,
              +     "preparation": "$inputRoot.recipe.preparation",
              +     "preparationTime": $inputRoot.recipe.preparationTime,
              +     "favorite": $inputRoot.recipe.favorite
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_delete" {
        id                      = "agi-gaj1kflz21-kntxqx-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    measurementId = "$input.params('measurementId')"
                    userId        = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_get" {
        id                      = "agi-gaj1kflz21-kntxqx-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    measurementId = "$input.params('measurementId')"
                    type          = "single"
                    userId        = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_options" {
        id                   = "agi-gaj1kflz21-kntxqx-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_id_integration_put will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_id_integration_put" {
        id                      = "agi-gaj1kflz21-kntxqx-PUT"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - #set($hasNote =  $input.path('$.measurement.note') != "")
              - #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              - #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              - #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              - #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              - #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              - {
              -   "measurement" : {
              -     "measurementId": "$input.params('measurementId')",
              -     "userId": "$context.authorizer.claims.sub",
              -     "date": $inputRoot.measurement.date,
              -     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              -     "measurements": {
              -       "weight" : $inputRoot.measurement.measurements.weight
              -       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              -       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              -       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              -       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              -       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              -     }
              -   }
              + #set($inputRoot = $input.path('$'))
              + #set($hasNote =  $input.path('$.measurement.note') != "")
              + #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              + #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              + #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              + #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              + #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              + {
              +   "measurement" : {
              +     "measurementId": "$input.params('measurementId')",
              +     "userId": "$context.authorizer.claims.sub",
              +     "date": $inputRoot.measurement.date,
              +     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              +     "measurements": {
              +       "weight" : $inputRoot.measurement.measurements.weight
              +       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              +       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              +       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              +       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              +       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              +     }
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_get" {
        id                      = "agi-gaj1kflz21-t9qag3-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_options" {
        id                   = "agi-gaj1kflz21-t9qag3-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_measurements_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_measurements_integration_post" {
        id                      = "agi-gaj1kflz21-t9qag3-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - #set($hasNote =  $input.path('$.measurement.note') != "")
              - #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              - #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              - #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              - #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              - #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              - {
              -   "measurement" : {
              -     "userId": "$context.authorizer.claims.sub",
              -     "date": $inputRoot.measurement.date,
              -     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              -     "measurements": {
              -       "weight" : $inputRoot.measurement.measurements.weight
              -       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              -       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              -       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              -       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              -       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              -     }
              -   }
              + #set($inputRoot = $input.path('$'))
              + #set($hasNote =  $input.path('$.measurement.note') != "")
              + #set($hasBodyFatPercentage =  $input.path('$.measurement.measurements.bodyFatPercentage') != "")
              + #set($hasWaterPercentage = $input.path('$.measurement.measurements.waterPercentage') != "")
              + #set($hasMuscleMassPercentage = $input.path('$.measurement.measurements.muscleMassPercentage') != "")
              + #set($hasBonePercentage = $input.path('$.measurement.measurements.bonePercentage') != "")
              + #set($hasEnergyExpenditure = $input.path('$.measurement.measurements.energyExpenditure') != "")
              + {
              +   "measurement" : {
              +     "userId": "$context.authorizer.claims.sub",
              +     "date": $inputRoot.measurement.date,
              +     #if($hasNote) "note": "$inputRoot.measurement.note", #end
              +     "measurements": {
              +       "weight" : $inputRoot.measurement.measurements.weight
              +       #if($hasBodyFatPercentage), "bodyFatPercentage": $inputRoot.measurement.measurements.bodyFatPercentage #end
              +       #if($hasWaterPercentage), "waterPercentage": $inputRoot.measurement.measurements.waterPercentage #end
              +       #if($hasMuscleMassPercentage), "muscleMassPercentage": $inputRoot.measurement.measurements.muscleMassPercentage #end
              +       #if($hasBonePercentage), "bonePercentage": $inputRoot.measurement.measurements.bonePercentage #end
              +       #if($hasEnergyExpenditure), "energyExpenditure": $inputRoot.measurement.measurements.energyExpenditure #end
              +     }
              +   }
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_delete will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_delete" {
        id                      = "agi-gaj1kflz21-pu0tuf-DELETE"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recordId = "$input.params('recordId')"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_get" {
        id                      = "agi-gaj1kflz21-pu0tuf-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    recordId = "$input.params('recordId')"
                    type     = "single"
                    userId   = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_id_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_id_integration_options" {
        id                   = "agi-gaj1kflz21-pu0tuf-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_get will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_get" {
        id                      = "agi-gaj1kflz21-l1qa8q-GET"
      ~ request_templates       = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    type   = "all"
                    userId = "$context.authorizer.claims.sub"
                }
            )
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_options will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_options" {
        id                   = "agi-gaj1kflz21-l1qa8q-OPTIONS"
      ~ request_templates    = {
          ~ "application/json" = jsonencode( # whitespace changes
                {
                    statusCode = 200
                }
            )
        }
        # (10 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration.weight_targets_integration_post will be updated in-place
  ~ resource "aws_api_gateway_integration" "weight_targets_integration_post" {
        id                      = "agi-gaj1kflz21-l1qa8q-POST"
      ~ request_templates       = {
          ~ "application/json" = <<-EOT
              - #set($inputRoot = $input.path('$'))
              - {
              -   "userId": "$context.authorizer.claims.sub",
              -   "targetWeight": $inputRoot.targetWeight
              + #set($inputRoot = $input.path('$'))
              + {
              +   "userId": "$context.authorizer.claims.sub",
              +   "targetWeight": $inputRoot.targetWeight
                }
            EOT
        }
        # (12 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.delete_user_data_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "delete_user_data_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-j8n2v2-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "masterdata_list_values_id_integration_get_res_200" {
        id                  = "agir-gaj1kflz21-59jb9r-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasValues =  $input.json('$.body.values').isEmpty())
              - {
              -   "values": #if($hasValues) [] #else $input.json('$.body.values') #end
              + #set($hasValues =  $input.json('$.body.values').isEmpty())
              + {
              +   "values": #if($hasValues) [] #else $input.json('$.body.values') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "masterdata_list_values_id_integration_get_res_400" {
        id                  = "agir-gaj1kflz21-59jb9r-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.masterdata_list_values_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "masterdata_list_values_id_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-59jb9r-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_id_integration_res_delete_500" {
        id                  = "agir-gaj1kflz21-6oclb6-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_id_integration_res_get_200" {
        id                  = "agir-gaj1kflz21-6oclb6-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "recipe": $input.json('$.body.recipe')
              + {
              +   "recipe": $input.json('$.body.recipe')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_id_integration_res_get_400" {
        id                  = "agir-gaj1kflz21-6oclb6-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_id_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-6oclb6-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_put_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_id_integration_res_put_200" {
        id                  = "agir-gaj1kflz21-6oclb6-PUT-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasRecipe =  $input.json('$.body.recipe')  != "")
              - {
              -   "recipe": #if($hasRecipe) $input.json('$.body.recipe') #else {} #end
              + #set($hasRecipe =  $input.json('$.body.recipe')  != "")
              + {
              +   "recipe": #if($hasRecipe) $input.json('$.body.recipe') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_id_integration_res_put_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_id_integration_res_put_500" {
        id                  = "agir-gaj1kflz21-6oclb6-PUT-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_integration_get_res_200" {
        id                  = "agir-gaj1kflz21-a6u6vg-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoRecipes =  $input.json('$.body.recipes').isEmpty())
              - {
              -   "recipes": #if($hasNoRecipes) [] #else $input.json('$.body.recipes') #end
              + #set($hasNoRecipes =  $input.json('$.body.recipes').isEmpty())
              + {
              +   "recipes": #if($hasNoRecipes) [] #else $input.json('$.body.recipes') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_integration_get_res_400" {
        id                  = "agir-gaj1kflz21-a6u6vg-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-a6u6vg-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_integration_res_post_200" {
        id                  = "agir-gaj1kflz21-a6u6vg-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasRecipe =  $input.json('$.body.recipes')  != "")
              - {
              -   "recipe": #if($hasRecipe) $input.json('$.body.recipe') #else {} #end
              + #set($hasRecipe =  $input.json('$.body.recipes')  != "")
              + {
              +   "recipe": #if($hasRecipe) $input.json('$.body.recipe') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_integration_res_post_400" {
        id                  = "agir-gaj1kflz21-a6u6vg-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.meal_recipes_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "meal_recipes_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-a6u6vg-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_delete_500" {
        id                  = "agir-gaj1kflz21-kntxqx-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_200" {
        id                  = "agir-gaj1kflz21-kntxqx-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "measurement": $input.json('$.body.measurement')
              + {
              +   "measurement": $input.json('$.body.measurement')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_400" {
        id                  = "agir-gaj1kflz21-kntxqx-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-kntxqx-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_put_200" {
        id                  = "agir-gaj1kflz21-kntxqx-PUT-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              - {
              -   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
              + #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              + {
              +   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_id_integration_res_put_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_id_integration_res_put_500" {
        id                  = "agir-gaj1kflz21-kntxqx-PUT-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_get_res_200" {
        id                  = "agir-gaj1kflz21-t9qag3-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoMeasurements =  $input.json('$.body.measurements').isEmpty())
              - {
              -   "measurements": #if($hasNoMeasurements) [] #else $input.json('$.body.measurements') #end
              + #set($hasNoMeasurements =  $input.json('$.body.measurements').isEmpty())
              + {
              +   "measurements": #if($hasNoMeasurements) [] #else $input.json('$.body.measurements') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_get_res_400" {
        id                  = "agir-gaj1kflz21-t9qag3-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-t9qag3-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_200" {
        id                  = "agir-gaj1kflz21-t9qag3-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              - {
              -   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
              + #set($hasMeasurement =  $input.json('$.body.measurements')  != "")
              + {
              +   "measurement": #if($hasMeasurement) $input.json('$.body.measurement') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_400" {
        id                  = "agir-gaj1kflz21-t9qag3-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_measurements_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_measurements_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-t9qag3-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_delete_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_delete_500" {
        id                  = "agir-gaj1kflz21-pu0tuf-DELETE-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_200" {
        id                  = "agir-gaj1kflz21-pu0tuf-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - {
              -   "target": $input.json('$.body.target')
              + {
              +   "target": $input.json('$.body.target')
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_400" {
        id                  = "agir-gaj1kflz21-pu0tuf-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_id_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_id_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-pu0tuf-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_get_res_200" {
        id                  = "agir-gaj1kflz21-l1qa8q-GET-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasNoTargets =  $input.json('$.body.targetWeights').isEmpty())
              - {
              -   "targetWeights": #if($hasNoTargets) [] #else $input.json('$.body.targetWeights') #end
              + #set($hasNoTargets =  $input.json('$.body.targetWeights').isEmpty())
              + {
              +   "targetWeights": #if($hasNoTargets) [] #else $input.json('$.body.targetWeights') #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_get_res_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_get_res_400" {
        id                  = "agir-gaj1kflz21-l1qa8q-GET-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_get_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_get_500" {
        id                  = "agir-gaj1kflz21-l1qa8q-GET-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_200 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_200" {
        id                  = "agir-gaj1kflz21-l1qa8q-POST-200"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($hasTarget =  $input.json('$.body.targetWeight')  != "")
              - {
              -   "target": #if($hasTarget) $input.json('$.body.targetWeight') #else {} #end
              + #set($hasTarget =  $input.json('$.body.targetWeight')  != "")
              + {
              +   "target": #if($hasTarget) $input.json('$.body.targetWeight') #else {} #end
                }
            EOT
        }
        # (5 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_400 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_400" {
        id                  = "agir-gaj1kflz21-l1qa8q-POST-400"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_integration_response.weight_targets_integration_res_post_500 will be updated in-place
  ~ resource "aws_api_gateway_integration_response" "weight_targets_integration_res_post_500" {
        id                  = "agir-gaj1kflz21-l1qa8q-POST-500"
      ~ response_templates  = {
          ~ "application/json" = <<-EOT
              - #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              - {
              -   "errorMsg": "$errJson.body.error"
              + #set($errJson = $util.parseJson($input.path('$.errorMessage')))
              + {
              +   "errorMsg": "$errJson.body.error"
                }
            EOT
        }
        # (6 unchanged attributes hidden)
    }

  # module.api.aws_api_gateway_stage.jowe_stage will be updated in-place
  ~ resource "aws_api_gateway_stage" "jowe_stage" {
      ~ deployment_id         = "5bq0h3" -> (known after apply)
        id                    = "ags-gaj1kflz21-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.lambda.aws_cloudwatch_event_rule.user_data_deletion_schedule will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "user_data_deletion_schedule" {
        id                  = "JoWe-cloudwatch-user-data-deletion-schedule-dev"
        name                = "JoWe-cloudwatch-user-data-deletion-schedule-dev"
      ~ schedule_expression = "cron(0/5 * * * ? *)" -> "cron(0/30 * * * ? *)"
        tags                = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-cloudwatch-user-data-deletion-schedule"
        }
        # (5 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_function.list_values_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "list_values_retrieve_lambda" {
        id                             = "JoWe-api-list-values-retrieve-dev"
      ~ last_modified                  = "2023-08-31T22:37:00.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-masterdata-shared-layer:5",
        ] -> (known after apply)
      ~ source_code_hash               = "gjcqU+Bd9bbaPabL2WsfkM7RShCHeF8NsElQh6WLk6E=" -> "YlTzU3gqSaiAvlDufQ3j6TgTin75zvhGvdR0z74yhL8="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-list-values-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.meal_recipes_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "meal_recipes_delete_lambda" {
        id                             = "JoWe-api-meal-recipes-delete-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "0BNQTSWJPqJJxXMNsSpsdK9uOzscCQWTg6kU6+Hr3Ls=" -> "UFwYmHG+5x0TWASHTzwUt4+sivDoEgEzmUMMh6t8zkA="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-meal-recipes-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.meal_recipes_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "meal_recipes_delete_user_data_lambda" {
        id                             = "JoWe-api-meal-recipes-delete-user-data-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "j//G8/VFi5wgO5OzREEvJBvtr623YS1j49XBLuPD1HE=" -> "/iJlydjyFDAuGsJtyGzJVI4Au6S3iCN8FpaOIEIsTAU="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-meal-recipes-delete-user-data"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.meal_recipes_edit_lambda will be updated in-place
  ~ resource "aws_lambda_function" "meal_recipes_edit_lambda" {
        id                             = "JoWe-api-meal-recipes-edit-dev"
      ~ last_modified                  = "2023-09-07T22:54:04.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "sAytuzQvhNzonUXsgGXlVG3iysCgehf2vqGRetry83U=" -> "mhobCfcozF7s0AAc4RJpcWjNOnQ3IIgMwlXFdMPylVM="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-meal-recipes-edit"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.meal_recipes_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "meal_recipes_insert_lambda" {
        id                             = "JoWe-api-meal-recipes-insert-dev"
      ~ last_modified                  = "2023-09-07T22:40:41.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "0RVEGnhWW0OuoelDf85qHwHcCsEBaTtDIBdBA3zMMFs=" -> "uPnynf4tcGFBj0UbUVxgGiKTVnX6j2NDpxP4tuSLTmA="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-meal-recipes-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.meal_recipes_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "meal_recipes_retrieve_lambda" {
        id                             = "JoWe-api-meal-recipes-retrieve-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10",
        ] -> (known after apply)
      ~ source_code_hash               = "BupELYBN5p7PsS8RPZB1JOVWEzC5B3RlGujXjDjawUY=" -> "vCNCPScyJFac4iw3CAcmrP5OvjDBpe0neZ+lNGKMcpA="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-meal-recipes-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-dev"
      ~ last_modified                  = "2023-08-30T21:02:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "+o1wo6y2FH/BtcC8clK3J1cH91sWx07g0CwtnqLYOVE=" -> "IV1B8278eyf8tDjdg6InwP48CeCx0XSVlCHe+U+Rij4="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-measurements-delete-user-data-dev"
      ~ last_modified                  = "2023-08-30T21:02:07.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "1ptjvzxBq/qbRmuX1QLRGIrZxxe+QIUqMKpKRjzr3zE=" -> "lWVAFZhdgyI5zWmE0rctsxFKcRuOkFKjguu4Ztwud7Q="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-delete-user-data"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_edit_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_edit_lambda" {
        id                             = "JoWe-api-weight-measurements-edit-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "1s7BHiowjhxocJwPUVFkb1SP9Xp3atDkDQALz1116aw=" -> "cdJEBGmrLz2YF8v2jxJsxYhlgUvD1Hg0pKsG8Lzjs4M="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-edit"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_insert_lambda" {
        id                             = "JoWe-api-weight-measurements-insert-dev"
      ~ last_modified                  = "2023-08-30T21:02:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "v+2cleHjj6j07Py5SH5eORRwN36lbKQSGxyuKyjtXXI=" -> "5BdE77fPpsKJ751QaWyl6f/pKRJvwAB1d8sUnup3Vwk="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_measurements_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_measurements_retrieve_lambda" {
        id                             = "JoWe-api-weight-measurements-retrieve-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "jTLin1e/1OeiEfo5ee70l1gJDk8PT/F00Xv40lqHzAA=" -> "3ANonni3HaHWim4662HMIk45nj3qiQSIc/LzrQsUXC0="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-measurements-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_lambda" {
        id                             = "JoWe-api-weight-targets-delete-dev"
      ~ last_modified                  = "2023-08-30T21:02:10.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "HXM+eMntXgWk6WwoLmLciSDTqzPjOYo998Fc02TWV9Y=" -> "V2bKx7L/NDLus8wd3vUfTed8kdU/jzN09z7hdUXm2hQ="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_delete_user_data_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_delete_user_data_lambda" {
        id                             = "JoWe-api-weight-targets-delete-user-data-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "koFFLPq8coume3xwk2eKbJuEgEgj861Iedcg0RIyTio=" -> "+MoPOUjCbFL+Y9JVwG+Yyxc71R42oMpixiRS8XpvUyc="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-delete"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_insert_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_insert_lambda" {
        id                             = "JoWe-api-weight-targets-insert-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "Zgg5NkoK4OAcmnCA8mC0nVaXvzAz6+xqmVTA0Z0Xhcw=" -> "vlRv9/F0sGslbtogwdQDUPKsH7VihQYPlE1agns9xOI="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-insert"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_function.weight_targets_retrieve_lambda will be updated in-place
  ~ resource "aws_lambda_function" "weight_targets_retrieve_lambda" {
        id                             = "JoWe-api-weight-targets-retrieve-dev"
      ~ last_modified                  = "2023-08-30T21:02:03.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34",
          - "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23",
        ] -> (known after apply)
      ~ source_code_hash               = "qzMUgdqDasKMbEQs+8Cwc2NFZC875TSxtWDgXqK7E9I=" -> "ObdBFGfi/6fQaz3Sv5HDqWiL2LM74McQ/D7Thv5p9oc="
        tags                           = {
            "App"         = "JoWe"
            "Environment" = "dev"
            "Name"        = "JoWe-api-weight-targets-retrieve"
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda.aws_lambda_layer_version.common_layer must be replaced
+/- resource "aws_lambda_layer_version" "common_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-30T21:02:02.806+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer:34" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-common-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "qjZLYjhCk90KmIyiVR7dHClNACBgW3BTC82RY7gYxpg=" -> "lsUD/egGaieCmcbaFQ+71UX+SMcT4lxpdaOTqBw/Kxo=" # forces replacement
      ~ source_code_size            = 2504 -> (known after apply)
      ~ version                     = "34" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_layer_version.masterdata_shared_layer must be replaced
+/- resource "aws_lambda_layer_version" "masterdata_shared_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-masterdata-shared-layer:5" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-31T22:36:59.958+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-masterdata-shared-layer:5" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-masterdata-shared-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "embEoaiO2Ul6Og70odI32dAeRkck6/y1tQU3xTrxcA0=" -> "BlDHSV61LihifGy+K4v0PthPkOvcGX+KWkkXDfk23yU=" # forces replacement
      ~ source_code_size            = 642 -> (known after apply)
      ~ version                     = "5" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_layer_version.meal_shared_layer must be replaced
+/- resource "aws_lambda_layer_version" "meal_shared_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-29T20:18:40.715+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer:10" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-meal-shared-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "QswNpyiqDNjgIdMtnW3PF5qnUPNzAcvK9gMc50yoKsE=" -> "6jJN6weA43SZRWevpszzHUkfVYFWlWR9botWsC/yUPQ=" # forces replacement
      ~ source_code_size            = 801 -> (known after apply)
      ~ version                     = "10" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda.aws_lambda_layer_version.weight_shared_layer must be replaced
+/- resource "aws_lambda_layer_version" "weight_shared_layer" {
      ~ arn                         = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2023-08-29T20:18:44.918+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer:23" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:eu-south-1:834514932971:layer:JoWe-weight-shared-layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "slYsPOOz9yS8nc/thScLpaWGXf5DL4j8J7R1IIv9NBE=" -> "AQAEIzZQ/geTgmi6vgsYoU9WiEAflSqhIKCPERNyfz4=" # forces replacement
      ~ source_code_size            = 2000 -> (known after apply)
      ~ version                     = "23" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 5 to add, 79 to change, 5 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 25 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @dependabot[bot], Action: `pull_request`*